<a href="https://colab.research.google.com/github/AsifQuasmi/Data-Science/blob/master/Pandas-MissingData.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
d = {'A': [1,2,np.nan],'B':[1,np.nan,np.nan],'C':[4,5,6]}

In [4]:
d

{'A': [1, 2, nan], 'B': [1, nan, nan], 'C': [4, 5, 6]}

In [5]:
df = pd.DataFrame(d)

In [6]:
df

     A    B  C
0  1.0  1.0  4
1  2.0  NaN  5
2  NaN  NaN  6

In [7]:
df.dropna()

     A    B  C
0  1.0  1.0  4

In [8]:
df.dropna(axis=1)

   C
0  4
1  5
2  6

In [9]:
df

     A    B  C
0  1.0  1.0  4
1  2.0  NaN  5
2  NaN  NaN  6

In [11]:
df.dropna(thresh=2)

     A    B  C
0  1.0  1.0  4
1  2.0  NaN  5

In [12]:
df.fillna(value = 'Fill Value')

            A           B  C
0           1           1  4
1           2  Fill Value  5
2  Fill Value  Fill Value  6

In [13]:
df

     A    B  C
0  1.0  1.0  4
1  2.0  NaN  5
2  NaN  NaN  6

In [14]:
df['A']

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [15]:
df['A'].fillna(value = 1)

0    1.0
1    2.0
2    1.0
Name: A, dtype: float64

In [16]:
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64